# Вывести последнюю букву в слове
word = 'Архангельск'
print(word)


# Вывести количество букв "а" в слове
word = 'Архангельск'



# Вывести количество гласных букв в слове
word = 'Архангельск'
# ???


# Вывести количество слов в предложении
sentence = 'Мы приехали в гости'
# ???


# Вывести первую букву каждого слова на отдельной строке
senten4e = 'Мы приехали в гости'
# ???


# Вывести усреднённую длину слова в предложении
sentence = 'Мы приехали в гости'
# ???